# Використовуємо базовий образ Ruby з підтримкою Alpine Linux
# Визначає початковий образ для побудови нашого Docker-образу. Обираємо образ Ruby версії 2.7.2 на основі легкого дистрибутиву Alpine Linux.
FROM ruby:2.7.2-alpine

# Встановлюємо необхідні пакети та залежності для Redmine
# Використовує apk (Alpine Package Keeper) для встановлення необхідних пакетів та залежностей у системі. 
# Це включає засоби для компіляції (build-base), розробки бази даних MariaDB (mariadb-dev), таймзону (tzdata), інструмент для роботи з графікою (imagemagick), а також Node.js та Yarn для управління пакетами та ассетами.
RUN apk add --update --no-cache \
    build-base \
    mariadb-dev \
    tzdata \
    imagemagick \
    nodejs \
    yarn

# Задаємо робочий каталог
# Встановлює робочий каталог для подальших команд у контексті цього Dockerfile на /usr/src/redmine.
WORKDIR /usr/src/redmine

# Копіюємо файли Redmine в робочий каталог
# Копіює усі файли та каталоги з поточного контексту (локальної машини, де виконується docker build) до робочого каталогу /usr/src/redmine контейнера.
COPY . .

# Встановлюємо геми та пре-компілюємо ассети
# Використовує bundle для встановлення гемів, необхідних для Redmine. 
# Потім виконує кілька команд для налаштування Redmine у виробничому режимі, включаючи генерацію секретного токену, міграцію бази даних та завантаження типових даних.
RUN bundle install --without development test \
    && bundle exec rake generate_secret_token \
    && RAILS_ENV=production bundle exec rake db:migrate \
    && RAILS_ENV=production bundle exec rake redmine:load_default_data

# Вказуємо, на якому порту працює Redmine (зазвичай 3000)
# Вказуємо, що контейнер використовує порт 3000. 
# Це необов'язкове поле, але може бути корисним для документації, якщо планується публікація портів з контейнера на зовнішній світ.
EXPOSE 3000

# Команда для запуску Redmine
# Задає команду, яка буде виконуватися під час запуску контейнера. У цьому випадку вказана команда для запуску сервера Redmine.
CMD ["rails", "server", "-b", "0.0.0.0"]
